// // 案例1：一元运算符 +[]
// // []转数字是0，所以+a→0
// console.log(+[]); // 0

// // 案例2：[1,2,3] + '1'
// // [1,2,3]转原始值（按String规则）→"1,2,3"（字符串）
// // 有字符串，所以拼接→"1,2,31"
// console.log([1,2,3] + '1'); // "1,2,31"

// // 案例3：{} + 1
// // {}转原始值（按Number规则）→toString()返回"[object Object]"，转数字→NaN
// // NaN + 1 → NaN
// console.log({} + 1); // NaN

// // 案例4：true + 1
// // true转数字→1，所以1+1=2（没有字符串，做加法）
// console.log(true + 1); // 2


// 案例1：if({}) → 对象转布尔true，执行代码
if({}) {
  console.log('对象转布尔是true'); // 会执行
}

// 案例2：if([]) → 数组转布尔true，执行代码
if([]) {
  console.log('空数组转布尔也是true'); // 会执行
}

// 案例3：if('') → 空字符串转布尔false，不执行
if('') {
  console.log('这句话不会输出');
}